uhnp/src/Documents/СведенияДляИсчисленияДоплатыКПенсииСЗВ_ДСО/СведенияДляИсчисленияДоплатыКПенсииСЗВ_ДСО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СведенияДляИсчисленияДоплатыКПенсииСЗВ_ДСО</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтчетныйПериод</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеОтчетногоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПринятВСФР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаДляСФР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>79</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипСведений</name>
    <type>
      <types>EnumRef.ТипыСведенийСЗВ_ДСО</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьРуководителя</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлСформирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткийСоставДокумента</name>
    <comment>АПК:58 различие имени и синонима - проектное решение</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрежнийСтраховательРегистрационныйНомерПФР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрежнийСтраховательНаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрежнийСтраховательИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрежнийСтраховательКПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяТрудЧленовЛетныхЭкипажей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяТрудШахтеров</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КорректируемыйПериод</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеКорректируемогоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>СтраховойНомерПФР</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Фамилия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отчество</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заработок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФиксСтаж</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ФиксЗаработок</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтрокиСотрудника</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЧленыЛетныхЭкипажей</name>
    <attributes>
      <name>ИдентификаторСтрокиСотрудника</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидСтажа</name>
      <type>
        <types>EnumRef.ВидыСтажаЛетныхЭкипажей</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачалаПериода</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияПериода</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Минуты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Шахтеры</name>
    <attributes>
      <name>ИдентификаторСтрокиСотрудника</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидСтажа</name>
      <type>
        <types>EnumRef.ВидыСтажаШахтеров</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачалаПериода</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияПериода</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СведенияОЗаработке</name>
    <attributes>
      <name>ИдентификаторСтрокиСотрудника</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодМесяца</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>8</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заработок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФизическиеЛица</name>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/Documents/СведенияДляИсчисленияДоплатыКПенсииСЗВ_ДСО/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ИспользуетсяТрудЧленовЛетныхЭкипажей Тогда 
		ЧленыЛетныхЭкипажей.Очистить();
	КонецЕсли;
	
	Если Не ИспользуетсяТрудШахтеров Тогда 
		Шахтеры.Очистить();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ИмяФайлаДляСФР) Тогда
		ИмяФайлаДляСФР = Документы.СведенияДляИсчисленияДоплатыКПенсииСЗВ_ДСО.ИмяФайла(Организация, Дата);
	Иначе		
		УИДИзИмениФайла = Прав(ИмяФайлаДляСФР, 36);
		Если Не СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(УИДИзИмениФайла) Тогда
			УИДИзИмениФайла = Строка(Новый УникальныйИдентификатор);	
		КонецЕсли;	
		ИмяФайлаДляСФР = Документы.СведенияДляИсчисленияДоплатыКПенсииСЗВ_ДСО.ИмяФайла(Организация, Дата, УИДИзИмениФайла);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Не УчетСтраховыхВзносов.ОрганизацияОтчитываетсяПоВзносамСамостоятельно(Организация, ОтчетныйПериод) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Организация не отчитывается самостоятельно';
																|en = 'Company does not report independently'"), ЭтотОбъект, , , Отказ);
	КонецЕсли;
	
	Ошибки = Неопределено;
	ДополнительныеСвойства.Свойство("Ошибки", Ошибки);
	
	Если Не ДополнительныеСвойства.Свойство("НеПроверятьДанныеОрганизации") Тогда
		ПерсонифицированныйУчет.ПроверитьДанныеОрганизации(ЭтотОбъект, Организация, Отказ, , Ошибки);
	КонецЕсли;	
	
	Если Не ИспользуетсяТрудЧленовЛетныхЭкипажей И Не ИспользуетсяТрудШахтеров Тогда 
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Для организации должно быть установлено испольльзование труда членов летных экипажей или шахтеров';
													|en = 'The use of labor of flight crew members or miners must be specified for the company'"), , , , Отказ);
	КонецЕсли;
	
	УникальныеСтраховыеНомера = Новый Соответствие;
	Для Каждого ДанныеСотрудника Из Сотрудники Цикл 
		Если ЗначениеЗаполнено(ДанныеСотрудника.СтраховойНомерПФР) Тогда 
			Если УникальныеСтраховыеНомера[ДанныеСотрудника.СтраховойНомерПФР] <> Неопределено Тогда 
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Строка %1: СНИЛС %2 уже был введен ранее в строке %3.';
						|en = 'Line %1: SNILS%2 is already filled in line %3.'"),
					ДанныеСотрудника.НомерСтроки, ДанныеСотрудника.СтраховойНомерПФР, УникальныеСтраховыеНомера[ДанныеСотрудника.СтраховойНомерПФР]);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка,
					"Объект.Сотрудники[" + Формат(ДанныеСотрудника.НомерСтроки - 1, "ЧН=0; ЧГ=0") + "].СтраховойНомерПФР" , , Отказ);
			Иначе 
				УникальныеСтраховыеНомера.Вставить(ДанныеСотрудника.СтраховойНомерПФР, ДанныеСотрудника.НомерСтроки);
			КонецЕсли;
			ТекстСообщения = "";
			Если Не РегламентированныеДанныеКлиентСервер.СтраховойНомерПФРСоответствуетТребованиям(ДанныеСотрудника.СтраховойНомерПФР, ТекстСообщения) Тогда 
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка,
					"Объект.Сотрудники[" + Формат(ДанныеСотрудника.НомерСтроки - 1, "ЧН=0; ЧГ=0") + "].СтраховойНомерПФР" , , Отказ);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	НачалоПериода = Документы.СведенияДляИсчисленияДоплатыКПенсииСЗВ_ДСО.НачалоПериодаДокумента(ТипСведений, ОтчетныйПериод, КорректируемыйПериод);
	ОкончаниеПериода = Документы.СведенияДляИсчисленияДоплатыКПенсииСЗВ_ДСО.ОкончаниеПериодаДокумента(ТипСведений, ОкончаниеОтчетногоПериода, ОкончаниеКорректируемогоПериода);
	
	Для Каждого ДанныеСтажа Из ЧленыЛетныхЭкипажей Цикл 
		Если ДанныеСтажа.ДатаНачалаПериода > ОкончаниеПериода
			Или ДанныеСтажа.ДатаОкончанияПериода < НачалоПериода Тогда 
			Отбор = Новый Структура("ИдентификаторСтрокиСотрудника", ДанныеСтажа.ИдентификаторСтрокиСотрудника);
			НайденныеСтроки = Сотрудники.НайтиСтроки(Отбор);
			Если НайденныеСтроки.Количество() > 0 Тогда
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Строка %1: Период стажа (%2 - %3) выходит за границы отчетного периода.';
						|en = 'Line %1: The service period (%2 - %3) is beyond the accounting period.'"),
					НайденныеСтроки[0].НомерСтроки, Формат(ДанныеСтажа.ДатаНачалаПериода, "ДЛФ=Д"), Формат(ДанныеСтажа.ДатаОкончанияПериода, "ДЛФ=Д"));
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка,
					"Объект.Сотрудники[" + Формат(НайденныеСтроки[0].НомерСтроки - 1, "ЧН=0; ЧГ=0") + "].Сотрудник" , , Отказ);
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ДанныеСтажа Из Шахтеры Цикл 
		Если ДанныеСтажа.ДатаНачалаПериода > ОкончаниеПериода
			Или ДанныеСтажа.ДатаОкончанияПериода < НачалоПериода Тогда 
			Отбор = Новый Структура("ИдентификаторСтрокиСотрудника", ДанныеСтажа.ИдентификаторСтрокиСотрудника);
			НайденныеСтроки = Сотрудники.НайтиСтроки(Отбор);
			Если НайденныеСтроки.Количество() > 0 Тогда
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Строка %1: Период стажа (%2 - %3) выходит за границы отчетного периода.';
						|en = 'Line %1: The service period (%2 - %3) is beyond the accounting period.'"),
					НайденныеСтроки[0].НомерСтроки, Формат(ДанныеСтажа.ДатаНачалаПериода, "ДЛФ=Д"), Формат(ДанныеСтажа.ДатаОкончанияПериода, "ДЛФ=Д"));
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка,
					"Объект.Сотрудники[" + Формат(НайденныеСтроки[0].НомерСтроки - 1, "ЧН=0; ЧГ=0") + "].Сотрудник" , , Отказ);
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьДанныеДокумента(Отказ = Ложь) Экспорт 
	
	Если Не ПроверитьЗаполнение() Тогда
		Отказ = Истина;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли
